app/views/houses/show.html.erb

SELECT "characters".* FROM "characters" WHERE "characters"."house_id" = $1  [["house_id", 16]]
---
<h1> <%= @house.name %></h1>
<% @house.characters.each do |character| %>