app/controllers/characters_controller.rb

  def show
    @house = House.find(params[:house_id])
    @character = @house.characters.find(params[:id])
---
SELECT  "characters".* FROM "characters" WHERE "characters"."house_id" = $1 AND "characters"."id" = $2 LIMIT $3  [["house_id", 16], ["id", 3], ["LIMIT", 1]]

  def create
    @house = House.find(params[:house_id])
    @character = @house.characters.create(character_params)
---
INSERT INTO "characters" ("name", "quote", "house_id") VALUES ($1, $2, $3) RETURNING "id"  [["name", "TEST"], ["quote", "TEST"], ["house_id", 16]]

  def edit
    @house = House.find(params[:house_id])
    @character = Character.find(params[:id])
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    @house = House.find(params[:house_id])
    @character = @house.characters.find(params[:id])
    @character.update(character_params)
---
SELECT  "characters".* FROM "characters" WHERE "characters"."house_id" = $1 AND "characters"."id" = $2 LIMIT $3  [["house_id", 29], ["id", 23], ["LIMIT", 1]]
UPDATE "characters" SET "img_url" = $1 WHERE "characters"."id" = $2  [["img_url", "http://vignette3.wikia.nocookie.net/gameofthrones/images/0/0f/610_Benjen_Promo_Crop.png/revision/latest?cb=20160629183134"], ["id", 53]]

  def destroy
    @house = House.find(params[:house_id])
    @character = Character.find(params[:id])
    @character.destroy
---
SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 5]]