app/controllers/houses_controller.rb

INSERT INTO "houses" ("name", "slogan", "img_url") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test"], ["slogan", "test"], ["img_url", "test"]]
---
def create
  @house = House.create(house_params)

UPDATE "houses" SET "name" = $1 WHERE "houses"."id" = $2  [["name", "House Starks"], ["id", 16]]
---
def update
  @house = House.find(params[:id])
  @house.update(house_params)

DELETE FROM "houses" WHERE "houses"."id" = $1  [["id", 21]]
---
def destroy
  @house = House.find(params[:id])
  @house.destroy